In [29]:
import pandas as pd
import numpy as np

In [30]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [31]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [13]:
type(df['FlightNumber'])

pandas.core.series.Series

In [32]:
flightList = []
flightNumber = 10045
while flightNumber!=10095:
    flightList.append(flightNumber)
    flightNumber=flightNumber+10

In [33]:
flightList

[10045, 10055, 10065, 10075, 10085]

In [34]:
flightSeries=pd.Series(flightList)

In [35]:
flightSeries

0    10045
1    10055
2    10065
3    10075
4    10085
dtype: int64

In [36]:
df['FlightNumber']=flightSeries

In [37]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [38]:
df['FlightNumber'].dtypes

dtype('int64')

In [39]:
df[['From','To']] = df.From_To.str.split("_",expand=True)

In [40]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [41]:
df = df.drop(columns=['From_To'])

In [42]:
def firstLetterCapital(string):
    string = string.lower()
    listOfString = list(string)
    listOfString[0]=listOfString[0].upper()
    string = ''.join(listOfString)
    return string

In [43]:
df[['From']] = df['From'].apply(firstLetterCapital)

In [44]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      paris
1         10055            []    <Air France> (12)    Madrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    London  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [45]:
df['To'] = df['To'].apply(firstLetterCapital)

In [46]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [66]:

dict= {}
del1=[]
del2=[]
del3=[]

for x in df['RecentDelays']:
    length = len(x)
    print (length)
    if length==0:
        del1=np.append(del1,np.nan)
        del2=np.append(del2,np.nan)
        del3=np.append(del3,np.nan)
    elif length == 1:
        del1=np.append(del1,x[0])
        del2=np.append(del2,np.nan)
        del3=np.append(del3,np.nan)
    elif length == 2:
        del1=np.append(del1,x[0])
        del2=np.append(del2,x[1])
        del3=np.append(del3,np.nan)
    elif length == 3:
        del1=np.append(del1,x[0])
        del2=np.append(del2,x[1])
        del3= np.append(del3,x[2])
    
        
dict={'delay_1':del1,'delay_2':del2,'delay_3':del3}
dict

2
0
3
1
2

{'delay_1': array([23., nan, 24., 13., 67.]),
 'delay_2': array([47., nan, 43., nan, 32.]),
 'delay_3': array([nan, nan, 87., nan, nan])}

In [67]:
delays = pd.DataFrame(dict)

In [68]:
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [80]:
df = df.drop(columns=['RecentDelays'])

In [82]:
df['delay_1'] = delays['delay_1']
df['delay_2'] = delays['delay_2']
df['delay_3'] = delays['delay_3']

In [83]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN